; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p11---int100n150-m25---int100c150---s186---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level11 level11)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level11 level12)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level11 level13)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level11 level14)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level11 level15)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level11 level16)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level11 level17)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level11 level18)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level11 level19)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level11 level20)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level11 level21)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level11 level22)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level11 level23)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level11 level24)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level11 level25)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level11 level26)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level11 level27)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level11 level28)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level7 level28)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level25 level2 level27)
(sum level26 level2 level28)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l2)
(fuelcost level2 l0 l2)
(connected l0 l3)
(fuelcost level11 l0 l3)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l2)
(fuelcost level8 l1 l2)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l2 l0)
(fuelcost level2 l2 l0)
(connected l2 l1)
(fuelcost level8 l2 l1)
(connected l2 l3)
(fuelcost level8 l2 l3)
(connected l3 l0)
(fuelcost level11 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l2)
(fuelcost level8 l3 l2)

(at t0 l3)
(fuel t0 level28)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l3)
(at p3 l1)
(at p4 l3)
(at p5 l1)
(at p6 l0)
(at p7 l2)
(at p8 l2)
(at p9 l3)
(at p10 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l2)
(at p3 l0)
(at p4 l2)
(at p5 l2)
(at p6 l2)
(at p7 l0)
(at p8 l1)
(at p9 l2)
(at p10 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 11
2. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 11
3. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 11
4. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 11
5. (drive t0 l3 l2 level20 level8 level28)
   deleted: (at t0 l3) (fuel t0 level28)
   added: (at t0 l2) (fuel t0 level20)
   goals met: 0 of 11
6. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 1 of 11
7. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 11
8. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 2 of 11
9. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 2 of 11
10. (drive t0 l2 l1 level12 level8 level20)
   deleted: (at t0 l2) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level12)
   goals met: 2 of 11
11. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 2 of 11
12. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 2 of 11
13. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 3 of 11
14. (drive t0 l1 l0 level8 level4 level12)
   deleted: (at t0 l1) (fuel t0 level12)
   added: (at t0 l0) (fuel t0 level8)
   goals met: 3 of 11
15. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 11
16. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 3 of 11
17. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 11
18. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 4 of 11
19. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 5 of 11
20. (drive t0 l0 l2 level6 level2 level8)
   deleted: (at t0 l0) (fuel t0 level8)
   added: (at t0 l2) (fuel t0 level6)
   goals met: 5 of 11
21. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 6 of 11
22. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 7 of 11
23. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 8 of 11
24. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 9 of 11
25. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 10 of 11
26. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 11 of 11
